apple-open-source/macos/IOUSBFamily/AppleUSBHub/Classes/AppleUSBHub.cpp
}	

bool
AppleUSBHub::ValidateHubDevice()
{
	UInt32			info = 0;
	IOReturn		status = kIOReturnSuccess;
	
	status = _device->GetDeviceInformation(&info);
	
	if (status != kIOReturnSuccess)
	{
		USBLog(3, "AppleUSBHub[%p]::ValidateHubDevice - Hub @ 0x%x GetDeviceInformation returned 0x%x, exiting", this, (uint32_t)_locationID, status );
		return false;
	}
	
	// If not built in return false
	if( not (info & (1 << kUSBInformationDeviceIsInternalBit)) )
	{
		USBLog(3, "AppleUSBHub[%p]::ValidateHubDevice - Hub @ 0x%x is not internal, exiting", this, (uint32_t)_locationID );
		return false;
	}
	
	// If not a known hub or root hub then return false
	if(		not _device->compareName(OSString::withCString("HubDevice"))			  
	   &&	not _device->compareName(OSString::withCString("EHCI Root Hub Simulation")) 
	   &&	not _device->compareName(OSString::withCString("OHCI Root Hub Simulation"))  ) 
	{
		USBLog(3, "AppleUSBHub[%p]::ValidateHubDevice - Hub @ 0x%x is %s, exiting", this, (uint32_t)_locationID, _device->getName() );
		return false;
	}
	
	return true;
}

bool
AppleUSBHub::HasInternalDevice(UInt32 portnum)
{
	bool internal = false;
	
	USBLog(6, "AppleUSBHub[%p]::HasInternalDevice - Hub @ 0x%x is %s", this, (uint32_t)_locationID, _device->getName() );
	
	if( ValidateHubDevice() )
	{
		IORegistryEntry *parent = _device->getParentEntry(gIOServicePlane);
		
		if (parent)
		{
			IORegistryEntry *grandParent = parent->getParentEntry(gIOServicePlane);
			
			if (grandParent)
			{
				internal = _device->GetBus()->IsPortInternal(grandParent, portnum);
			}
		}	
	}
	
	USBLog(6, "AppleUSBHub[%p]::HasInternalDevice - Hub @ 0x%x has %s device in port %d", this, (uint32_t)_locationID, (internal == true)? "internal" : "external", (unsigned int)portnum );
	
	return internal;
}	

bool
AppleUSBHub::HasExpressCardPort()
{
	USBLog(6, "AppleUSBHub[%p]::HasExpressCardPort - Hub @ 0x%x is %s", this, (uint32_t)_locationID, _device->getName() );

	if( ValidateHubDevice() )
	{
		IORegistryEntry *parent = _device->getParentEntry(gIOServicePlane);
		
		if (parent)
		{
			IORegistryEntry *grandParent = parent->getParentEntry(gIOServicePlane);
			
			if (grandParent)
			{
				_expressCardPort = _device->GetBus()->ExpressCardPort(grandParent);
			}
		}	
	}
	
	USBLog(6, "AppleUSBHub[%p]::HasExpressCardPort - Hub @ 0x%x _expressCardPort %s", this, (uint32_t)_locationID, (_expressCardPort > 0)? "found" : "not found" );

	return (_expressCardPort > 0);
}	
